src/toir_cf/src/Reports/торо_АнализЧастотыКоренныхПричинДефектов/торо_АнализЧастотыКоренныхПричинДефектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_АнализЧастотыКоренныхПричинДефектов</name>
</mdclass:Report>

src/toir_cf/src/InformationRegisters/торо_КоренныеПричиныДефектов/торо_КоренныеПричиныДефектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_КоренныеПричиныДефектов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НепосредственнаяПричина</name>
    <type>
      <types>CatalogRef.торо_ПричиныДефектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КореннаяПричина</name>
    <type>
      <types>CatalogRef.торо_КоренныеПричиныДефектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВыявленныеДефекты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДефектПричина</name>
    <type>
      <types>CatalogRef.торо_ПричиныДефектов</types>
    </type>
  </resources>
  <resources>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДефектОписаниеЯзык1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДефектОписаниеЯзык2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранениеЯзык1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранениеЯзык2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТиповойДефект</name>
    <type>
      <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ПоследствияДефекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследствияДефектаЯзык1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследствияДефектаЯзык2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Reports/торо_АнализЧастотыКоренныхПричинДефектов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ТекИерархия = торо_ОтчетыСервер.ПолучитьЗначениеСтруктурыИерархии(КомпоновщикНастроек);
	
	СодержательнаяЧастьЗапроса = ПолучитьСодержательнуюЧастьЗапроса();
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "КонецПериода");
		
	Если ТекИерархия.СтроитсяАвтоматически Тогда
		
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		СодержательнаяЧастьЗапроса +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Данные.КореннаяПричина,
		|	ВТ_Данные.НепосредственнаяПричина,
		|	ВТ_Данные.ОбъектРемонта,
		|	ВТ_Данные.ВыявленныйДефект,
		|	ВТ_Данные.ДатаСобытия,
		|	ВТ_Данные.ОтказавшийЭлемент,
		|	ВТ_Данные.ОписаниеДефекта,
		|	ВТ_Данные.КритичностьДефекта,
		|	ВТ_Данные.Количество,
		|	ВТ_Данные.ПериодДефекта,
		|	торо_ОбъектыРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_Данные.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|";
		
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		СодержательнаяЧастьЗапроса +        
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Данные.КореннаяПричина,
		|	ВТ_Данные.НепосредственнаяПричина,
		|	ВТ_Данные.ОбъектРемонта,
		|	ВТ_Данные.ВыявленныйДефект,
		|	ВТ_Данные.ДатаСобытия,
		|	ВТ_Данные.ОтказавшийЭлемент,
		|	ВТ_Данные.ОписаниеДефекта,
		|	ВТ_Данные.КритичностьДефекта,
		|	ВТ_Данные.Количество,
		|	ВТ_Данные.ПериодДефекта,
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_Данные.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = ЗагрузитьНастройкиПриИзмененииПараметров();

КонецПроцедуры

Функция ЗагрузитьНастройкиПриИзмененииПараметров()  
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ИерархияТип"));	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_КоренныеПричиныДефектов.КореннаяПричина КАК КореннаяПричина,
	|	торо_КоренныеПричиныДефектов.НепосредственнаяПричина КАК НепосредственнаяПричина,
	|	торо_КоренныеПричиныДефектов.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_КоренныеПричиныДефектов.Регистратор.ДокументОснование КАК ВыявленныйДефект,
	|	торо_КоренныеПричиныДефектов.ДатаСобытия КАК ДатаСобытия,
	|	торо_ВыявленныеДефекты.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	торо_ВыявленныеДефекты.ДефектОписание КАК ОписаниеДефекта,
	|	торо_ВыявленныеДефекты.КритичностьДефекта КАК КритичностьДефекта,
	|	1 КАК Количество,
	|	торо_КоренныеПричиныДефектов.ОбъектРемонта КАК ОбъектИерархии,
	|		ВЫБОР &Периодичность
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|		ТОГДА НАЧАЛОПЕРИОДА(торо_КоренныеПричиныДефектов.ДатаСобытия, МЕСЯЦ)
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|		ТОГДА НАЧАЛОПЕРИОДА(торо_КоренныеПричиныДефектов.ДатаСобытия, ГОД)
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|		ТОГДА НАЧАЛОПЕРИОДА(торо_КоренныеПричиныДефектов.ДатаСобытия, КВАРТАЛ)
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|		ТОГДА НАЧАЛОПЕРИОДА(торо_КоренныеПричиныДефектов.ДатаСобытия, НЕДЕЛЯ)
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|		ТОГДА НАЧАЛОПЕРИОДА(торо_КоренныеПричиныДефектов.ДатаСобытия, ДЕНЬ)	
	|   КОНЕЦ КАК ПериодДефекта
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.торо_КоренныеПричиныДефектов КАК торо_КоренныеПричиныДефектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ПО торо_КоренныеПричиныДефектов.ИДРемонта = торо_ВыявленныеДефекты.ID
	|{ГДЕ
	|	(торо_КоренныеПричиныДефектов.ДатаСобытия >= &НачалоПериода),
	|	(торо_КоренныеПричиныДефектов.ДатаСобытия <= &КонецПериода)}
	|
	|СГРУППИРОВАТЬ ПО
	|	МЕСЯЦ(торо_КоренныеПричиныДефектов.ДатаСобытия),
	|	ГОД(торо_КоренныеПричиныДефектов.ДатаСобытия),
	|	торо_КоренныеПричиныДефектов.КореннаяПричина,
	|	торо_КоренныеПричиныДефектов.НепосредственнаяПричина,
	|	торо_КоренныеПричиныДефектов.ОбъектРемонта,
	|	торо_КоренныеПричиныДефектов.Регистратор.ДокументОснование,
	|	торо_КоренныеПричиныДефектов.ДатаСобытия,
	|	торо_ВыявленныеДефекты.ОтказавшийЭлемент,
	|	торо_ВыявленныеДефекты.ДефектОписание,
	|	торо_ВыявленныеДефекты.КритичностьДефекта,
	|	торо_КоренныеПричиныДефектов.ОбъектРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта"

	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ЗапросТекст;
	
КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
